app/controllers/tournaments_controller.rb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]
---
  def api
  	tournament = Tournament.find_by(id: params[:id])

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "newTournament"], ["created_at", "2016-05-02 22:20:12.458103"], ["updated_at", "2016-05-02 22:20:12.458103"]]
---
  def create
  	tournament = Tournament.create(tournament_params)